; domain
(define (domain warehouse)
 (:requirements :strips :typing)
 (:types robot package location)

 (:predicates
  (at-robot ?r - robot ?l - location)
  (at-package ?p - package ?l - location)
  (carrying ?r - robot ?p - package)
  (robot-free ?r - robot)
    (assigned ?p - package ?r - robot)
  (connected ?from - location ?to - location)
 )

 ;; --- Move action (robot moves between connected zones)
 (:action move
  :parameters (?r - robot ?from - location ?to - location)
  :precondition (and
    (at-robot ?r ?from)
    (connected ?from ?to)
  )
  :effect (and
    (not (at-robot ?r ?from))
    (at-robot ?r ?to)
  )
 )

 ;; --- Pickup action
 (:action pickup
  :parameters (?r - robot ?p - package ?l - location)
  :precondition (and
    (at-robot ?r ?l)
    (at-package ?p ?l)
    (robot-free ?r)
    (assigned ?p ?r)
  )
  :effect (and
    (not (at-package ?p ?l))
    (not (robot-free ?r))
    (carrying ?r ?p)
  )
 )

 ;; --- Drop action
 (:action drop
  :parameters (?r - robot ?p - package ?l - location)
  :precondition (and
    (at-robot ?r ?l)
    (carrying ?r ?p)
  )
  :effect (and
    (at-package ?p ?l)
    (not (carrying ?r ?p))
    (robot-free ?r)
  )
 )
)

; problem
(define (problem warehouse-delivery)
 (:domain warehouse)

 (:objects
  r1 r2 - robot
  p2 p3 - package
  zone_0_0 zone_0_1 zone_0_2 zone_0_3 zone_0_4 zone_0_5 zone_0_6 zone_1_0 zone_1_1 zone_1_2 zone_1_3 zone_1_4 zone_1_5 zone_1_6 zone_2_0 zone_2_1 zone_2_2 zone_2_3 zone_2_6 zone_3_0 zone_3_1 zone_3_2 zone_3_3 zone_3_4 zone_3_5 zone_3_6 zone_4_0 zone_4_3 zone_4_4 zone_4_5 zone_4_6 zone_5_0 zone_5_1 zone_5_2 zone_5_3 zone_5_4 zone_5_5 zone_5_6 zone_6_0 zone_6_1 zone_6_2 zone_6_3 zone_6_4 zone_6_5 zone_6_6 - location
 )

 (:init
  (at-robot r1 zone_0_3)
  (robot-free r1)
  (at-robot r2 zone_2_3)
  (robot-free r2)
  (at-package p2 zone_0_5)
  (assigned p2 r1)
  (at-package p3 zone_6_5)
  (assigned p3 r2)
  (connected zone_0_0 zone_0_1)
  (connected zone_0_0 zone_1_0)
  (connected zone_0_1 zone_0_2)
  (connected zone_0_1 zone_0_0)
  (connected zone_0_1 zone_1_1)
  (connected zone_0_2 zone_0_3)
  (connected zone_0_2 zone_0_1)
  (connected zone_0_2 zone_1_2)
  (connected zone_0_3 zone_0_4)
  (connected zone_0_3 zone_0_2)
  (connected zone_0_3 zone_1_3)
  (connected zone_0_4 zone_0_5)
  (connected zone_0_4 zone_0_3)
  (connected zone_0_4 zone_1_4)
  (connected zone_0_5 zone_0_6)
  (connected zone_0_5 zone_0_4)
  (connected zone_0_5 zone_1_5)
  (connected zone_0_6 zone_0_5)
  (connected zone_0_6 zone_1_6)
  (connected zone_1_0 zone_1_1)
  (connected zone_1_0 zone_2_0)
  (connected zone_1_0 zone_0_0)
  (connected zone_1_1 zone_1_2)
  (connected zone_1_1 zone_1_0)
  (connected zone_1_1 zone_2_1)
  (connected zone_1_1 zone_0_1)
  (connected zone_1_2 zone_1_3)
  (connected zone_1_2 zone_1_1)
  (connected zone_1_2 zone_2_2)
  (connected zone_1_2 zone_0_2)
  (connected zone_1_3 zone_1_4)
  (connected zone_1_3 zone_1_2)
  (connected zone_1_3 zone_2_3)
  (connected zone_1_3 zone_0_3)
  (connected zone_1_4 zone_1_5)
  (connected zone_1_4 zone_1_3)
  (connected zone_1_4 zone_0_4)
  (connected zone_1_5 zone_1_6)
  (connected zone_1_5 zone_1_4)
  (connected zone_1_5 zone_0_5)
  (connected zone_1_6 zone_1_5)
  (connected zone_1_6 zone_2_6)
  (connected zone_1_6 zone_0_6)
  (connected zone_2_0 zone_2_1)
  (connected zone_2_0 zone_3_0)
  (connected zone_2_0 zone_1_0)
  (connected zone_2_1 zone_2_2)
  (connected zone_2_1 zone_2_0)
  (connected zone_2_1 zone_3_1)
  (connected zone_2_1 zone_1_1)
  (connected zone_2_2 zone_2_3)
  (connected zone_2_2 zone_2_1)
  (connected zone_2_2 zone_3_2)
  (connected zone_2_2 zone_1_2)
  (connected zone_2_3 zone_2_2)
  (connected zone_2_3 zone_3_3)
  (connected zone_2_3 zone_1_3)
  (connected zone_2_6 zone_3_6)
  (connected zone_2_6 zone_1_6)
  (connected zone_3_0 zone_3_1)
  (connected zone_3_0 zone_4_0)
  (connected zone_3_0 zone_2_0)
  (connected zone_3_1 zone_3_2)
  (connected zone_3_1 zone_3_0)
  (connected zone_3_1 zone_2_1)
  (connected zone_3_2 zone_3_3)
  (connected zone_3_2 zone_3_1)
  (connected zone_3_2 zone_2_2)
  (connected zone_3_3 zone_3_4)
  (connected zone_3_3 zone_3_2)
  (connected zone_3_3 zone_4_3)
  (connected zone_3_3 zone_2_3)
  (connected zone_3_4 zone_3_5)
  (connected zone_3_4 zone_3_3)
  (connected zone_3_4 zone_4_4)
  (connected zone_3_5 zone_3_6)
  (connected zone_3_5 zone_3_4)
  (connected zone_3_5 zone_4_5)
  (connected zone_3_6 zone_3_5)
  (connected zone_3_6 zone_4_6)
  (connected zone_3_6 zone_2_6)
  (connected zone_4_0 zone_5_0)
  (connected zone_4_0 zone_3_0)
  (connected zone_4_3 zone_4_4)
  (connected zone_4_3 zone_5_3)
  (connected zone_4_3 zone_3_3)
  (connected zone_4_4 zone_4_5)
  (connected zone_4_4 zone_4_3)
  (connected zone_4_4 zone_5_4)
  (connected zone_4_4 zone_3_4)
  (connected zone_4_5 zone_4_6)
  (connected zone_4_5 zone_4_4)
  (connected zone_4_5 zone_5_5)
  (connected zone_4_5 zone_3_5)
  (connected zone_4_6 zone_4_5)
  (connected zone_4_6 zone_5_6)
  (connected zone_4_6 zone_3_6)
  (connected zone_5_0 zone_5_1)
  (connected zone_5_0 zone_6_0)
  (connected zone_5_0 zone_4_0)
  (connected zone_5_1 zone_5_2)
  (connected zone_5_1 zone_5_0)
  (connected zone_5_1 zone_6_1)
  (connected zone_5_2 zone_5_3)
  (connected zone_5_2 zone_5_1)
  (connected zone_5_2 zone_6_2)
  (connected zone_5_3 zone_5_4)
  (connected zone_5_3 zone_5_2)
  (connected zone_5_3 zone_6_3)
  (connected zone_5_3 zone_4_3)
  (connected zone_5_4 zone_5_5)
  (connected zone_5_4 zone_5_3)
  (connected zone_5_4 zone_6_4)
  (connected zone_5_4 zone_4_4)
  (connected zone_5_5 zone_5_6)
  (connected zone_5_5 zone_5_4)
  (connected zone_5_5 zone_6_5)
  (connected zone_5_5 zone_4_5)
  (connected zone_5_6 zone_5_5)
  (connected zone_5_6 zone_6_6)
  (connected zone_5_6 zone_4_6)
  (connected zone_6_0 zone_6_1)
  (connected zone_6_0 zone_5_0)
  (connected zone_6_1 zone_6_2)
  (connected zone_6_1 zone_6_0)
  (connected zone_6_1 zone_5_1)
  (connected zone_6_2 zone_6_3)
  (connected zone_6_2 zone_6_1)
  (connected zone_6_2 zone_5_2)
  (connected zone_6_3 zone_6_4)
  (connected zone_6_3 zone_6_2)
  (connected zone_6_3 zone_5_3)
  (connected zone_6_4 zone_6_5)
  (connected zone_6_4 zone_6_3)
  (connected zone_6_4 zone_5_4)
  (connected zone_6_5 zone_6_6)
  (connected zone_6_5 zone_6_4)
  (connected zone_6_5 zone_5_5)
  (connected zone_6_6 zone_6_5)
  (connected zone_6_6 zone_5_6)
 )

 (:goal (and
  (at-package p2 zone_3_5)
  (at-package p3 zone_0_6)
 ))
)

; plan
1. (move r2 zone_2_3 zone_3_3)
   deleted: (at-robot r2 zone_2_3)
   added: (at-robot r2 zone_3_3)
   goals met: 0 of 2
2. (move r2 zone_3_3 zone_3_4)
   deleted: (at-robot r2 zone_3_3)
   added: (at-robot r2 zone_3_4)
   goals met: 0 of 2
3. (move r2 zone_3_4 zone_3_5)
   deleted: (at-robot r2 zone_3_4)
   added: (at-robot r2 zone_3_5)
   goals met: 0 of 2
4. (move r1 zone_0_3 zone_0_4)
   deleted: (at-robot r1 zone_0_3)
   added: (at-robot r1 zone_0_4)
   goals met: 0 of 2
5. (move r1 zone_0_4 zone_0_5)
   deleted: (at-robot r1 zone_0_4)
   added: (at-robot r1 zone_0_5)
   goals met: 0 of 2
6. (pickup r1 p2 zone_0_5)
   deleted: (at-package p2 zone_0_5) (robot-free r1)
   added: (carrying r1 p2)
   goals met: 0 of 2
7. (move r1 zone_0_5 zone_0_6)
   deleted: (at-robot r1 zone_0_5)
   added: (at-robot r1 zone_0_6)
   goals met: 0 of 2
8. (move r1 zone_0_6 zone_1_6)
   deleted: (at-robot r1 zone_0_6)
   added: (at-robot r1 zone_1_6)
   goals met: 0 of 2
9. (move r1 zone_1_6 zone_2_6)
   deleted: (at-robot r1 zone_1_6)
   added: (at-robot r1 zone_2_6)
   goals met: 0 of 2
10. (move r1 zone_2_6 zone_3_6)
   deleted: (at-robot r1 zone_2_6)
   added: (at-robot r1 zone_3_6)
   goals met: 0 of 2
11. (move r1 zone_3_6 zone_3_5)
   deleted: (at-robot r1 zone_3_6)
   added: (at-robot r1 zone_3_5)
   goals met: 0 of 2
12. (drop r1 p2 zone_3_5)
   deleted: (carrying r1 p2)
   added: (at-package p2 zone_3_5) (robot-free r1)
   goals met: 1 of 2
13. (move r2 zone_3_5 zone_4_5)
   deleted: (at-robot r2 zone_3_5)
   added: (at-robot r2 zone_4_5)
   goals met: 1 of 2
14. (move r2 zone_4_5 zone_5_5)
   deleted: (at-robot r2 zone_4_5)
   added: (at-robot r2 zone_5_5)
   goals met: 1 of 2
15. (move r2 zone_5_5 zone_6_5)
   deleted: (at-robot r2 zone_5_5)
   added: (at-robot r2 zone_6_5)
   goals met: 1 of 2
16. (pickup r2 p3 zone_6_5)
   deleted: (at-package p3 zone_6_5) (robot-free r2)
   added: (carrying r2 p3)
   goals met: 1 of 2
17. (move r2 zone_6_5 zone_5_5)
   deleted: (at-robot r2 zone_6_5)
   added: (at-robot r2 zone_5_5)
   goals met: 1 of 2
18. (move r2 zone_5_5 zone_4_5)
   deleted: (at-robot r2 zone_5_5)
   added: (at-robot r2 zone_4_5)
   goals met: 1 of 2
19. (move r2 zone_4_5 zone_3_5)
   deleted: (at-robot r2 zone_4_5)
   added: (at-robot r2 zone_3_5)
   goals met: 1 of 2
20. (move r2 zone_3_5 zone_3_6)
   deleted: (at-robot r2 zone_3_5)
   added: (at-robot r2 zone_3_6)
   goals met: 1 of 2
21. (move r2 zone_3_6 zone_2_6)
   deleted: (at-robot r2 zone_3_6)
   added: (at-robot r2 zone_2_6)
   goals met: 1 of 2
22. (move r2 zone_2_6 zone_1_6)
   deleted: (at-robot r2 zone_2_6)
   added: (at-robot r2 zone_1_6)
   goals met: 1 of 2
23. (move r2 zone_1_6 zone_0_6)
   deleted: (at-robot r2 zone_1_6)
   added: (at-robot r2 zone_0_6)
   goals met: 1 of 2
24. (drop r2 p3 zone_0_6)
   deleted: (carrying r2 p3)
   added: (at-package p3 zone_0_6) (robot-free r2)
   goals met: 2 of 2
